[
    {
        "name": "Air New Zealand",
        "projects": [
            {
                "name": "Star Alliance Redemption",
                "descriptions": [
                    "Built from the ground up using React and Typescript.",
                    "Closely involved with UX whilst developing the UI layout for the search for flight page, select flight page, and the confirmation page while adhering to the design standards.",
                    "Worked with back end developers to decide the API format.",
                    "Worked with automated testers on writing automated tests.",
                    "Able to deliver the project on-time on a strict hard deadline."
                ]
            },
            {
                "name": "Inflight Wifi Payment",
                "descriptions": [
                    "Built from the ground up using React and Typescript.",
                    "Worked closely with third party designers and AirNZ designers to follow a standard.",
                    "Made sure that it is PCI Compliant.",
                    "Fixed performance issues and dealing with unreliable connections.",
                    "Worked closely with the team using the Scrum model."
                ]
            },
            {
                "name": "Baggage Transit Unit Kiosk",
                "descriptions": [
                    "Refactored the codebase by removing unused code, added unit and integration tests, and set up the file architecture.",
                "Built using React and Typescript.",
                        "Worked closely with UX to set up the design standards for Kiosk."
                ]
            },
            {
                "name": "Unison Standard",
                "descriptions": [
                    "An early contributor to Air New Zealand new React common repositories, which is currently being used by multiple teams."
                ]
            },
            {
                "name": "ET-Navigator",
                "descriptions": [
                    "Built using React, React-Router, and Redux.",
                    "Developed a REST wrapper around the current SOAP services using Java and the SpringBoot framework.",
                    "Worked closely with project managers and business analysts around a vague requirement."
                ]
            },
            {
                "name": "Flight Booking/Post Booking",
                "descriptions": [
                    "Maintained the current booking website which is primarily designed in Knockout, Mootools, and JSP on the front end, and Stripes as the Java framework on the back-end.",
                    "Worked closely with the team using the Kanban model.",
                    "Developed several React components by wrapping them inside Knockout."
                ]
            },
            {
                "name": "Recommendation Project",
                "descriptions": [
                    "Built using Java and Apache Wicket as the framework, with Jetty as the web server. Hosted on premise."
                ]
            },
            {
                "name": "Air Forms",
                "descriptions": [
                    "Built using ASP.NET MVC4 and Bootstrap, and IIS as the web server. Hosted on premise."
                ]
            },
            {
                "descriptions": [
                    "Mentored graduates around the Javascript ecosystem. Introduced them to our design system, and code review their pull requests.",
                    "Actively contributed to the front-end development guild by highlighting the latest updates on the Javascript/React ecosystem.",
                    "Developed and maintained several SQL Reports and Stored Procedures to various departments using SQL Server Reporting Services."
                ]
            }
        ]
    },
    {
        "name": "Food Budget",
        "projects": [
            {
                "descriptions": [
                    "Developed the website using Next.js, React, Typescript, Node, Prisma ORM, Apollo Client, Apollo Server, Terraform, GraphQL"
                ]
            }
        ]
    },
    {
        "name": "Youngi Kim",
        "projects": [
            {
                "descriptions": [
                    "Website I made for my friend. Developed using Next.js, Typescript, React, with Strapi as the headless CMS."
                ]
            }
        ]
    },
    {
        "name": "BKA",
        "projects": [
            {
                "descriptions": [
                    "Maintain several websites like the Kauri Dieback, which were made in ASP.NET MVC4, using Umbraco as our CMS."
                ]
            }
        ]
    }
]